notes/meeting_2023feb26.md
- [meeting notes February 26, 2023](#org85e90fd)
  - [the raku study group](#org2dd4577)
  - [topics](#org7922c0f)
    - [the ever popular weekly challenge](#org2a615c5)
    - [being a better raku citizen](#org36cdf2c)
    - [jj merelo raku recipies code examples](#org5a47e9d)
  - [announcements](#org33df728)
    - [next meeting: February 26th](#org09615d4)
    - [doc meeting:  jit.sy issues?](#orge8c0196)


<a id="org85e90fd"></a>

# meeting notes February 26, 2023


<a id="org2dd4577"></a>

## the raku study group

1.  usual links

    1.  these notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023feb26.md>
        
        2.  source file (for corrections, etc)
        
            1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023feb26.org>
    
    2.  code examples
    
        1.  <https://github.com/doomvox/raku-study/tree/main/bin/2023feb26>
    
    3.  last meeting notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022feb12.md>


<a id="org7922c0f"></a>

## topics


<a id="org2a615c5"></a>

### the ever popular weekly challenge

1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-201/>

2.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-202/>

    <https://theweeklychallenge.org/blog/perl-weekly-challenge-205/>
    
    TASK #1: Third Highest
    
    You are given an array of integers. Write a script to find out the Third Highest if found otherwise return the maximum.
    
    TASK #2: Maximum XOR
    
    You are given an array of integers. Write a script to find the highest value obtained by XORing any two distinct members of the array.
    
    <https://theweeklychallenge.org/blog/perl-weekly-challenge-204/>
    
    Task 1: Monotonic Array Submitted by: Mohammad S Anwar You are given an array of integers.
    
    Write a script to find out if the given array is Monotonic. Print 1 if it is otherwise 0.
    
    Task 2: Reshape Matrix Submitted by: Mohammad S Anwar
    
    You are given a matrix (m x n) and two integers (r) and (c).
    
    Write a script to reshape the given matrix in form (r x c) with the original value in the given matrix. If you can’t reshape print 0.


<a id="org36cdf2c"></a>

### being a better raku citizen

1.  lizmat reminds she needs advance notice of meeting schedule for

2.  do we need a joint events calendar?

3.  irc

4.  vadim class

5.  marton meetings on docs

    1.  first one was yesterday
    
    2.  squashathon
    
        1.  <https://github.com/2colours/Raku-ideas/blob/main/Squashathon%20reborn.md>


<a id="org5a47e9d"></a>

### jj merelo raku recipies code examples

1.  <https://github.com/Apress/raku-recipes>


<a id="org33df728"></a>

## announcements


<a id="org09615d4"></a>

### next meeting: February 26th


<a id="orge8c0196"></a>

### doc meeting:  jit.sy issues?
